package Thread3_1.Thread3_1_11.p_r_test;

public class Run {
    public static void main(String[] args) {
        String lock = new String("");
        P p = new P(lock);
        C r = new C(lock);
        ThreadP pThread = new ThreadP(p);
        ThreadC cThread = new ThreadC(r);
        pThread.start();
        cThread.start();
    }
    /**
     * set 的值是：1552382163696_336091945701978
     * get 的值是：1552382163696_336091945701978
     * set 的值是：1552382163696_336091945736297
     * get 的值是：1552382163696_336091945736297
     * set 的值是：1552382163696_336091945773862
     * get 的值是：1552382163696_336091945773862
     * set 的值是：1552382163696_336091945842964
     * get 的值是：1552382163696_336091945842964
     * set 的值是：1552382163696_336091945881457
     * get 的值是：1552382163696_336091945881457
     * set 的值是：1552382163696_336091945916239
     * get 的值是：1552382163696_336091945916239
     * set 的值是：1552382163696_336091945988587
     * get 的值是：1552382163696_336091945988587
     * 一对一，不会出现问题
     */
}
